; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-24)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city10)
	(fuel-level plane1 fl6)
	(at plane2 city6)
	(fuel-level plane2 fl1)
	(at plane3 city8)
	(fuel-level plane3 fl1)
	(at plane4 city6)
	(fuel-level plane4 fl3)
	(at plane5 city5)
	(fuel-level plane5 fl2)
	(at plane6 city8)
	(fuel-level plane6 fl6)
	(at person1 city9)
	(at person2 city11)
	(at person3 city13)
	(at person4 city5)
	(at person5 city1)
	(at person6 city6)
	(at person7 city5)
	(at person8 city8)
	(at person9 city12)
	(at person10 city1)
	(at person11 city8)
	(at person12 city6)
	(at person13 city6)
	(at person14 city6)
	(at person15 city8)
	(at person16 city6)
	(at person17 city13)
	(at person18 city0)
	(at person19 city8)
	(at person20 city5)
	(at person21 city10)
	(at person22 city10)
	(at person23 city7)
	(at person24 city10)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city9)
	(at plane2 city12)
	(at plane3 city13)
	(at person1 city8)
	(at person2 city11)
	(at person4 city1)
	(at person5 city1)
	(at person6 city11)
	(at person7 city7)
	(at person8 city13)
	(at person9 city6)
	(at person10 city9)
	(at person11 city5)
	(at person12 city2)
	(at person13 city2)
	(at person14 city8)
	(at person15 city9)
	(at person16 city2)
	(at person17 city8)
	(at person18 city2)
	(at person19 city0)
	(at person20 city1)
	(at person21 city10)
	(at person22 city3)
	(at person23 city10)
	(at person24 city3)
	))

)

; plan
1. (fly plane6 city8 city0 fl6 fl5)
   deleted: (at plane6 city8) (fuel-level plane6 fl6)
   added: (at plane6 city0) (fuel-level plane6 fl5)
   goals met: 3 of 26
2. (board person18 plane6 city0)
   deleted: (at person18 city0)
   added: (in person18 plane6)
   goals met: 3 of 26
3. (zoom plane6 city0 city2 fl5 fl4 fl3)
   deleted: (at plane6 city0) (fuel-level plane6 fl5)
   added: (at plane6 city2) (fuel-level plane6 fl3)
   goals met: 3 of 26
4. (debark person18 plane6 city2)
   deleted: (in person18 plane6)
   added: (at person18 city2)
   goals met: 4 of 26
5. (board person7 plane5 city5)
   deleted: (at person7 city5)
   added: (in person7 plane5)
   goals met: 4 of 26
6. (board person4 plane5 city5)
   deleted: (at person4 city5)
   added: (in person4 plane5)
   goals met: 4 of 26
7. (board person20 plane5 city5)
   deleted: (at person20 city5)
   added: (in person20 plane5)
   goals met: 4 of 26
8. (zoom plane5 city5 city1 fl2 fl1 fl0)
   deleted: (at plane5 city5) (fuel-level plane5 fl2)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 4 of 26
9. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 4 of 26
10. (debark person4 plane5 city1)
   deleted: (in person4 plane5)
   added: (at person4 city1)
   goals met: 5 of 26
11. (debark person20 plane5 city1)
   deleted: (in person20 plane5)
   added: (at person20 city1)
   goals met: 6 of 26
12. (board person10 plane5 city1)
   deleted: (at person10 city1)
   added: (in person10 plane5)
   goals met: 6 of 26
13. (board person8 plane3 city8)
   deleted: (at person8 city8)
   added: (in person8 plane3)
   goals met: 6 of 26
14. (board person19 plane3 city8)
   deleted: (at person19 city8)
   added: (in person19 plane3)
   goals met: 6 of 26
15. (board person15 plane3 city8)
   deleted: (at person15 city8)
   added: (in person15 plane3)
   goals met: 6 of 26
16. (board person11 plane3 city8)
   deleted: (at person11 city8)
   added: (in person11 plane3)
   goals met: 6 of 26
17. (fly plane2 city6 city12 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 7 of 26
18. (board person6 plane4 city6)
   deleted: (at person6 city6)
   added: (in person6 plane4)
   goals met: 7 of 26
19. (board person16 plane4 city6)
   deleted: (at person16 city6)
   added: (in person16 plane4)
   goals met: 7 of 26
20. (board person14 plane4 city6)
   deleted: (at person14 city6)
   added: (in person14 plane4)
   goals met: 7 of 26
21. (board person13 plane4 city6)
   deleted: (at person13 city6)
   added: (in person13 plane4)
   goals met: 7 of 26
22. (zoom plane4 city6 city2 fl3 fl2 fl1)
   deleted: (at plane4 city6) (fuel-level plane4 fl3)
   added: (at plane4 city2) (fuel-level plane4 fl1)
   goals met: 7 of 26
23. (debark person16 plane4 city2)
   deleted: (in person16 plane4)
   added: (at person16 city2)
   goals met: 8 of 26
24. (debark person13 plane4 city2)
   deleted: (in person13 plane4)
   added: (at person13 city2)
   goals met: 9 of 26
25. (board person9 plane2 city12)
   deleted: (at person9 city12)
   added: (in person9 plane2)
   goals met: 9 of 26
26. (refuel plane2 city12 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 26
27. (board person24 plane1 city10)
   deleted: (at person24 city10)
   added: (in person24 plane1)
   goals met: 9 of 26
28. (zoom plane1 city10 city9 fl6 fl5 fl4)
   deleted: (at plane1 city10) (fuel-level plane1 fl6)
   added: (at plane1 city9) (fuel-level plane1 fl4)
   goals met: 10 of 26
29. (board person1 plane1 city9)
   deleted: (at person1 city9)
   added: (in person1 plane1)
   goals met: 10 of 26
30. (fly plane5 city1 city7 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city7) (fuel-level plane5 fl0)
   goals met: 10 of 26
31. (refuel plane5 city7 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 10 of 26
32. (debark person7 plane5 city7)
   deleted: (in person7 plane5)
   added: (at person7 city7)
   goals met: 11 of 26
33. (board person23 plane5 city7)
   deleted: (at person23 city7)
   added: (in person23 plane5)
   goals met: 11 of 26
34. (fly plane5 city7 city10 fl1 fl0)
   deleted: (at plane5 city7) (fuel-level plane5 fl1)
   added: (at plane5 city10) (fuel-level plane5 fl0)
   goals met: 11 of 26
35. (refuel plane5 city10 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 11 of 26
36. (debark person23 plane5 city10)
   deleted: (in person23 plane5)
   added: (at person23 city10)
   goals met: 12 of 26
37. (board person22 plane5 city10)
   deleted: (at person22 city10)
   added: (in person22 plane5)
   goals met: 12 of 26
38. (fly plane5 city10 city3 fl1 fl0)
   deleted: (at plane5 city10) (fuel-level plane5 fl1)
   added: (at plane5 city3) (fuel-level plane5 fl0)
   goals met: 12 of 26
39. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 12 of 26
40. (debark person22 plane5 city3)
   deleted: (in person22 plane5)
   added: (at person22 city3)
   goals met: 13 of 26
41. (fly plane5 city3 city9 fl1 fl0)
   deleted: (at plane5 city3) (fuel-level plane5 fl1)
   added: (at plane5 city9) (fuel-level plane5 fl0)
   goals met: 13 of 26
42. (debark person10 plane5 city9)
   deleted: (in person10 plane5)
   added: (at person10 city9)
   goals met: 14 of 26
43. (fly plane4 city2 city11 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city11) (fuel-level plane4 fl0)
   goals met: 14 of 26
44. (refuel plane4 city11 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 14 of 26
45. (debark person6 plane4 city11)
   deleted: (in person6 plane4)
   added: (at person6 city11)
   goals met: 15 of 26
46. (fly plane4 city11 city8 fl1 fl0)
   deleted: (at plane4 city11) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 15 of 26
47. (debark person14 plane4 city8)
   deleted: (in person14 plane4)
   added: (at person14 city8)
   goals met: 16 of 26
48. (zoom plane1 city9 city3 fl4 fl3 fl2)
   deleted: (at plane1 city9) (fuel-level plane1 fl4)
   added: (at plane1 city3) (fuel-level plane1 fl2)
   goals met: 15 of 26
49. (debark person24 plane1 city3)
   deleted: (in person24 plane1)
   added: (at person24 city3)
   goals met: 16 of 26
50. (zoom plane1 city3 city8 fl2 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl2)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 16 of 26
51. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 16 of 26
52. (debark person1 plane1 city8)
   deleted: (in person1 plane1)
   added: (at person1 city8)
   goals met: 17 of 26
53. (fly plane1 city8 city9 fl1 fl0)
   deleted: (at plane1 city8) (fuel-level plane1 fl1)
   added: (at plane1 city9) (fuel-level plane1 fl0)
   goals met: 18 of 26
54. (fly plane3 city8 city13 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 19 of 26
55. (refuel plane3 city13 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 19 of 26
56. (debark person8 plane3 city13)
   deleted: (in person8 plane3)
   added: (at person8 city13)
   goals met: 20 of 26
57. (board person17 plane3 city13)
   deleted: (at person17 city13)
   added: (in person17 plane3)
   goals met: 20 of 26
58. (fly plane2 city12 city6 fl1 fl0)
   deleted: (at plane2 city12) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 19 of 26
59. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 19 of 26
60. (debark person9 plane2 city6)
   deleted: (in person9 plane2)
   added: (at person9 city6)
   goals met: 20 of 26
61. (board person12 plane2 city6)
   deleted: (at person12 city6)
   added: (in person12 plane2)
   goals met: 20 of 26
62. (fly plane2 city6 city2 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 20 of 26
63. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 20 of 26
64. (debark person12 plane2 city2)
   deleted: (in person12 plane2)
   added: (at person12 city2)
   goals met: 21 of 26
65. (fly plane2 city2 city12 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 22 of 26
66. (fly plane3 city13 city0 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 21 of 26
67. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 21 of 26
68. (debark person19 plane3 city0)
   deleted: (in person19 plane3)
   added: (at person19 city0)
   goals met: 22 of 26
69. (fly plane3 city0 city5 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city5) (fuel-level plane3 fl0)
   goals met: 22 of 26
70. (refuel plane3 city5 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 22 of 26
71. (debark person11 plane3 city5)
   deleted: (in person11 plane3)
   added: (at person11 city5)
   goals met: 23 of 26
72. (fly plane3 city5 city8 fl1 fl0)
   deleted: (at plane3 city5) (fuel-level plane3 fl1)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 23 of 26
73. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 23 of 26
74. (debark person17 plane3 city8)
   deleted: (in person17 plane3)
   added: (at person17 city8)
   goals met: 24 of 26
75. (fly plane3 city8 city9 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city9) (fuel-level plane3 fl0)
   goals met: 24 of 26
76. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 24 of 26
77. (debark person15 plane3 city9)
   deleted: (in person15 plane3)
   added: (at person15 city9)
   goals met: 25 of 26
78. (fly plane3 city9 city13 fl1 fl0)
   deleted: (at plane3 city9) (fuel-level plane3 fl1)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 26 of 26
